Documents/ДоговорРеструктуризацииДолга.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>ДоговорРеструктуризацииДолга</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПлатежиПоРеструктуризацииДолга</xr:Item>
				<xr:Item>InformationRegister.НазначенныеУслуги</xr:Item>
				<xr:Item>InformationRegister.СостояниеРеструктуризацииДолга</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыПоЛицевымСчетам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаРассрочки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗавершенияРассрочки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДолга</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийДоговораРеструктуризацииДолга</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйВладелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПотребителиУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СтруктураДолга</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>МесяцНачисления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПлатежа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ОтветственныйВладелецЛицевогоСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ОтветственныйВладелецЛицевогоСчета</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОтветственныйВладелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПотребителиУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ДокументыФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ДокументыФизическихЛиц</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КемВыдан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПодразделения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЯвляетсяДокументомУдостоверяющимЛичность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументовФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Физлицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументовФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыОперацийДоговораРеструктуризацииДолга.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ВидыОперацийДоговораРеструктуризацииДолга</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗаключениеДоговора</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасторжениеДоговора</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтатусыРеструктуризации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>СтатусыРеструктуризации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Действует</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Просрочен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расторгнут</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ФизическиеЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>ФизическиеЛица</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПолФизическогоЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоРождения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МобильныйАгент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрыМобильногоАгента</Name>
					<Type>
						<v8:Type>cfg:ExchangePlanRef.ОбменСМобильнымиУстройствами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Паспорт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыдачиПаспорта</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДЛьготы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДСубсидия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/ДоговорРеструктуризацииДолга/Ext/ManagerModule.bsl
////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицуНачисленияПоРеструктуризацииДолга(ДокументСсылкаВводПоказанийПриборовУчета, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВременнаяТаблицаРеструктуризация.Период,
		|	ВременнаяТаблицаРеструктуризация.ЛицевойСчет,
		|	ВременнаяТаблицаРеструктуризация.СуммаПлатежа,
		|	ВременнаяТаблицаРеструктуризация.СуммаДолга КАК ОбщаяСумма
		|ИЗ
		|	ВременнаяТаблицаРеструктуризация КАК ВременнаяТаблицаРеструктуризация";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРеструктуризацияДолга", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицуРасчетПоказанийПриборовУчета()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицуСписанияРеструктурированногоДолга(ДокументСсылкаВводПоказанийПриборовУчета, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	НАЧАЛОПЕРИОДА(ВременнаяТаблицаРеструктуризация.ДатаСписания, ДЕНЬ) КАК Период,
		|	ВременнаяТаблицаРеструктуризация.Организация,
		|	ВременнаяТаблицаРеструктуризация.ЛицевойСчет,
		|	МАКСИМУМ(ВременнаяТаблицаРеструктуризация.СуммаДолга) КАК Сумма,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаРеструктуризация.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийДоговораРеструктуризацииДолга.ЗаключениеДоговора)
		|			ТОГДА &Услуга
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Услуги.ДолгиПрошлыхПериодов)
		|	КОНЕЦ КАК Услуга
		|ИЗ
		|	ВременнаяТаблицаРеструктуризация КАК ВременнаяТаблицаРеструктуризация
		|
		|СГРУППИРОВАТЬ ПО
		|	ВременнаяТаблицаРеструктуризация.ДатаСписания,
		|	ВременнаяТаблицаРеструктуризация.Организация,
		|	ВременнаяТаблицаРеструктуризация.ЛицевойСчет,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаРеструктуризация.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийДоговораРеструктуризацииДолга.ЗаключениеДоговора)
		|			ТОГДА &Услуга
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Услуги.ДолгиПрошлыхПериодов)
		|	КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
		|	ВременнаяТаблицаРеструктуризация.ДатаСписания,
		|	ВременнаяТаблицаРеструктуризация.Организация,
		|	ВременнаяТаблицаРеструктуризация.ЛицевойСчет,
		|	МАКСИМУМ(ВременнаяТаблицаРеструктуризация.СуммаДолга),
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаРеструктуризация.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.ВидыОперацийДоговораРеструктуризацииДолга.ЗаключениеДоговора)
		|			ТОГДА &Услуга
		|	КОНЕЦ
		|ИЗ
		|	ВременнаяТаблицаРеструктуризация КАК ВременнаяТаблицаРеструктуризация
		|
		|СГРУППИРОВАТЬ ПО
		|	ВременнаяТаблицаРеструктуризация.ДатаСписания,
		|	ВременнаяТаблицаРеструктуризация.Организация,
		|	ВременнаяТаблицаРеструктуризация.ЛицевойСчет,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаРеструктуризация.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.ВидыОперацийДоговораРеструктуризацииДолга.ЗаключениеДоговора)
		|			ТОГДА &Услуга
		|	КОНЕЦ";
		
	Запрос.УстановитьПараметр("Услуга",Справочники.Услуги.РеструктуризацияДолга);
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыПоЛицевымСчетам", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицуРасчетПоказанийПриборовУчета()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицуУстановкиУслугиНаЛицевойСчет(ДокументСсылкаВводПоказанийПриборовУчета, СтруктураДополнительныеСвойства)

	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВременнаяТаблицаРеструктуризация.Организация,
		|	ВременнаяТаблицаРеструктуризация.ЛицевойСчет,
		|	ВременнаяТаблицаРеструктуризация.Услуга,
		|	НАЧАЛОПЕРИОДА(ВременнаяТаблицаРеструктуризация.ДатаНачала, ДЕНЬ) КАК Период,
		|	МАКСИМУМ(ИСТИНА) КАК Действует
		|ИЗ
		|	ВременнаяТаблицаРеструктуризация КАК ВременнаяТаблицаРеструктуризация
		|
		|СГРУППИРОВАТЬ ПО
		|	НАЧАЛОПЕРИОДА(ВременнаяТаблицаРеструктуризация.ДатаНачала, ДЕНЬ),
		|	ВременнаяТаблицаРеструктуризация.Организация,
		|	ВременнаяТаблицаРеструктуризация.ЛицевойСчет,
		|	ВременнаяТаблицаРеструктуризация.Услуга
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВременнаяТаблицаРеструктуризация.Организация,
		|	ВременнаяТаблицаРеструктуризация.ЛицевойСчет,
		|	ВременнаяТаблицаРеструктуризация.Услуга,
		|	НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(ВременнаяТаблицаРеструктуризация.ДатаОкончания, МЕСЯЦ), ДЕНЬ, 1), ДЕНЬ),
		|	МАКСИМУМ(ЛОЖЬ)
		|ИЗ
		|	ВременнаяТаблицаРеструктуризация КАК ВременнаяТаблицаРеструктуризация
		|
		|СГРУППИРОВАТЬ ПО
		|	ВременнаяТаблицаРеструктуризация.Организация,
		|	ВременнаяТаблицаРеструктуризация.ЛицевойСчет,
		|	ВременнаяТаблицаРеструктуризация.Услуга,
		|	НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(ВременнаяТаблицаРеструктуризация.ДатаОкончания, МЕСЯЦ), ДЕНЬ, 1), ДЕНЬ)";
	
		
		РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаНазначенныеУслуги", РезультатЗапроса.Выгрузить());

КонецПроцедуры


Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаРеструктуризацияДолга, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = 
		 "ВЫБРАТЬ
		 |	КОНЕЦПЕРИОДА(ДоговорРеструктуризацииДолгаСтруктураДолга.МесяцНачисления, МЕСЯЦ) КАК Период,
		 |	ДоговорРеструктуризацииДолгаСтруктураДолга.СуммаПлатежа,
		 |	ЗНАЧЕНИЕ(Справочник.Услуги.РеструктуризацияДолга) КАК Услуга,
		 |	ДоговорРеструктуризацииДолга.ЛицевойСчет КАК ЛицевойСчет,
		 |	ДоговорРеструктуризацииДолга.Дата КАК ДатаСписания,
		 |	ДоговорРеструктуризацииДолга.СуммаДолга КАК СуммаДолга,
		 |	ДоговорРеструктуризацииДолга.Организация КАК Организация,
		 |	ДоговорРеструктуризацииДолга.ДатаНачалаРассрочки КАК ДатаНачала,
		 |	ДоговорРеструктуризацииДолга.ДатаЗавершенияРассрочки КАК ДатаОкончания,
		 |	ДоговорРеструктуризацииДолга.ВидОперации КАК ВидОперации
		 |ПОМЕСТИТЬ ВременнаяТаблицаРеструктуризация
		 |ИЗ
		 |	Документ.ДоговорРеструктуризацииДолга КАК ДоговорРеструктуризацииДолга
		 |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ДоговорРеструктуризацииДолга.СтруктураДолга КАК ДоговорРеструктуризацииДолгаСтруктураДолга
		 |		ПО ДоговорРеструктуризацииДолга.Ссылка = ДоговорРеструктуризацииДолгаСтруктураДолга.Ссылка
		 |ГДЕ
		 |	ДоговорРеструктуризацииДолга.Ссылка = &Ссылка";
	 
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаРеструктуризацияДолга);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если ДокументСсылкаРеструктуризацияДолга.ВидОперации = Перечисления.ВидыОперацийДоговораРеструктуризацииДолга.ЗаключениеДоговора Тогда
	СформироватьТаблицуУстановкиУслугиНаЛицевойСчет(ДокументСсылкаРеструктуризацияДолга, СтруктураДополнительныеСвойства);
	СформироватьТаблицуНачисленияПоРеструктуризацииДолга(ДокументСсылкаРеструктуризацияДолга, СтруктураДополнительныеСвойства);
	КонецЕсли; 
	СформироватьТаблицуСписанияРеструктурированногоДолга(ДокументСсылкаРеструктуризацияДолга, СтруктураДополнительныеСвойства);
	СформироватьТаблицуСостоянияРеструктуризации(ДокументСсылкаРеструктуризацияДолга, СтруктураДополнительныеСвойства);

КонецПроцедуры

// Формує таблицю стану реструктуризації для регістру СостояниеРеструктуризацииДолга
Процедура СформироватьТаблицуСостоянияРеструктуризации(ДокументСсылка, СтруктураДополнительныеСвойства)

	Статус = ?(ДокументСсылка.ВидОперации = Перечисления.ВидыОперацийДоговораРеструктуризацииДолга.ЗаключениеДоговора,
		Перечисления.СтатусыРеструктуризации.Действует,
		Перечисления.СтатусыРеструктуризации.Расторгнут);

	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Период");
	Таблица.Колонки.Добавить("ЛицевойСчет");
	Таблица.Колонки.Добавить("Статус");
	Таблица.Колонки.Добавить("Договор");
	Таблица.Колонки.Добавить("ДатаНачала");
	Таблица.Колонки.Добавить("ДатаОкончания");

	Стр = Таблица.Добавить();
	Стр.Период        = ДокументСсылка.Дата;
	Стр.ЛицевойСчет   = ДокументСсылка.ЛицевойСчет;
	Стр.Статус        = Статус;
	Стр.Договор       = ДокументСсылка;
	Стр.ДатаНачала    = ДокументСсылка.ДатаНачалаРассрочки;
	Стр.ДатаОкончания = ДокументСсылка.ДатаЗавершенияРассрочки;

	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСостояниеРеструктуризации", Таблица);

КонецПроцедуры


Процедура Печать(МассивОбъектов,
	ПараметрыПечати,
	КоллекцияПечатныхФорм,
	ОбъектыПечати,
	ПараметрыВывода) Экспорт
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ДоговорРеструктуризацииДолга") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ДоговорРеструктуризацииДолга", "Договор реструктуризации долга", ПечатьДокумента(МассивОбъектов, ОбъектыПечати, "ДоговорРеструктуризацииДолга"));
	КонецЕсли;	
	
КонецПроцедуры


Функция ПечатьДокумента(ТекущийДокумент, ОбъектыПечати, ИмяМакета)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_ДоговорРеструктуризацииДолга";
	
	ПервыйДокумент = Истина;
	
	
	Если НЕ ПервыйДокумент Тогда
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЕсли;
	ПервыйДокумент = Ложь;
	
	НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка", ТекущийДокумент);
	Запрос.УстановитьПараметр("Период", КонецДня(ТекущийДокумент.Дата));
	Запрос.УстановитьПараметр("ВидОрганизация", Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресОрганизации);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДоговорРеструктуризацииДолга.Номер КАК НомерДокумента,
	               |	ДоговорРеструктуризацииДолга.Дата КАК ДатаЗадолженности,
	               |	ДоговорРеструктуризацииДолга.Организация,
	               |	ДоговорРеструктуризацииДолга.Здание,
	               |	ДоговорРеструктуризацииДолга.СуммаДолга КАК СуммаДолга,
	               |	ДоговорРеструктуризацииДолга.ДатаНачалаРассрочки,
	               |	ДоговорРеструктуризацииДолга.ДатаЗавершенияРассрочки,
	               |	ДоговорРеструктуризацииДолга.Организация.ТекущийРуководитель,
	               |	ДоговорРеструктуризацииДолга.Организация.НаименованиеПолное,
	               |	ДоговорРеструктуризацииДолга.Организация.КодПоЕДРПОУ КАК ЕДРПОУ,
	               |	ДоговорРеструктуризацииДолга.ЛицевойСчет.Владелец.Код КАК НомерДома,
	               |	ДоговорРеструктуризацииДолга.Организация.БанковскийСчетПоУмолчанию.Банк КАК Банк,
	               |	ДоговорРеструктуризацииДолга.Организация.БанковскийСчетПоУмолчанию.Банк.Код КАК МФО,
	               |	ДоговорРеструктуризацииДолга.Организация.БанковскийСчетПоУмолчанию.НомерСчета КАК НомерСчета,
	               |	ВЫБОР
	               |		КОГДА ОрганизацииКонтактнаяИнформация.Вид = &ВидОрганизация
	               |			ТОГДА ОрганизацииКонтактнаяИнформация.ЗначенияПолей
	               |	КОНЕЦ КАК ЗначенияПолейОрганизация,
	               |	ЗданияИСооруженияКонтактнаяИнформация.ЗначенияПолей КАК ЗначенияПолейЗдание,
	               |	ВложенныйЗапрос.ЗначенияПолей КАК ЗначенияПолейПотребитель,
	               |	ВложенныйЗапрос.ОтветственныйВладелец,
	               |	ДоговорРеструктуризацииДолга.ЛицевойСчет.ОбъектЛицевогоСчета.Код КАК НомерКвартиры,
	               |	ВложенныйЗапрос.ИНН
	               |ИЗ
	               |	Документ.ДоговорРеструктуризацииДолга КАК ДоговорРеструктуризацииДолга
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
	               |		ПО ДоговорРеструктуризацииДолга.Организация = ОрганизацииКонтактнаяИнформация.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЗданияИСооружения.КонтактнаяИнформация КАК ЗданияИСооруженияКонтактнаяИнформация
	               |		ПО ДоговорРеструктуризацииДолга.Здание = ЗданияИСооруженияКонтактнаяИнформация.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ВложенныйЗапрос.ЛицевойСчет КАК ЛицевойСчет,
	               |			ВложенныйЗапрос.ОтветственныйВладелец КАК ОтветственныйВладелец,
	               |			ВложенныйЗапрос.ЗначенияПолей КАК ЗначенияПолей,
	               |			ВложенныйЗапрос.ИНН КАК ИНН
	               |		ИЗ
	               |			(ВЫБРАТЬ
	               |				ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
	               |				ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец КАК ОтветственныйВладелец,
	               |				ВЫБОР
	               |					КОГДА ФизическиеЛицаКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресДляИнформированияФизЛица)
	               |						ТОГДА ФизическиеЛицаКонтактнаяИнформация.ЗначенияПолей
	               |				КОНЕЦ КАК ЗначенияПолей,
	               |				ФизическиеЛицаКонтактнаяИнформация.Ссылка.ИНН КАК ИНН
	               |			ИЗ
	               |				РегистрСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних(&Период, ) КАК ОтветственныйВладелецЛицевогоСчетаСрезПоследних
	               |					ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица.КонтактнаяИнформация КАК ФизическиеЛицаКонтактнаяИнформация
	               |					ПО ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец.ФизЛицо = ФизическиеЛицаКонтактнаяИнформация.Ссылка
	               |			
	               |			ОБЪЕДИНИТЬ ВСЕ
	               |			
	               |			ВЫБРАТЬ
	               |				ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ЛицевойСчет,
	               |				ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец,
	               |				ВЫБОР
	               |					КОГДА КонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ПочтовыйАдресКонтрагента)
	               |						ТОГДА КонтрагентыКонтактнаяИнформация.ЗначенияПолей
	               |				КОНЕЦ,
	               |				КонтрагентыКонтактнаяИнформация.Ссылка.ИНН
	               |			ИЗ
	               |				РегистрСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних(&Период, ) КАК ОтветственныйВладелецЛицевогоСчетаСрезПоследних
	               |					ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
	               |					ПО ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец.ЮрЛицо = КонтрагентыКонтактнаяИнформация.Ссылка) КАК ВложенныйЗапрос) КАК ВложенныйЗапрос
	               |		ПО ДоговорРеструктуризацииДолга.ЛицевойСчет = ВложенныйЗапрос.ЛицевойСчет
	               |ГДЕ
	               |	ДоговорРеструктуризацииДолга.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДоговорРеструктуризацииДолгаСтруктураДолга.МесяцНачисления,
	               |	ДоговорРеструктуризацииДолгаСтруктураДолга.СуммаПлатежа,
	               |	ДоговорРеструктуризацииДолгаСтруктураДолга.НомерСтроки
	               |ИЗ
	               |	Документ.ДоговорРеструктуризацииДолга.СтруктураДолга КАК ДоговорРеструктуризацииДолгаСтруктураДолга
	               |ГДЕ
	               |	ДоговорРеструктуризацииДолгаСтруктураДолга.Ссылка = &Ссылка";
	
	Если ИмяМакета = "ДоговорРеструктуризацииДолга" Тогда
		
		Макет = ПолучитьМакет("ДоговорРеструктуризацииДолга");
		
		Результат = Запрос.ВыполнитьПакет();
		ВыборкаОсновная = Результат[0].Выбрать();
		ВыборкаПоТаблице = Результат[1].Выбрать();
		
		КоличествоСтрокРеструктуризации = ВыборкаПоТаблице.Количество();
		
		ВыборкаОсновная.Следующий();
		
		КИЗдания = ВыборкаОсновная.ЗначенияПолейЗдание;
		КИОрганизации = ВыборкаОсновная.ЗначенияПолейОрганизация;
		КИПотребителя = ВыборкаОсновная.ЗначенияПолейПотребитель;
		
		СписокПолейЗдание = УправлениеКонтактнойИнформацией.ПреобразоватьСтрокуВСписокПолей(КИЗдания);
		СписокПолейОрганизация = УправлениеКонтактнойИнформацией.ПреобразоватьСтрокуВСписокПолей(КИОрганизации);
		СписокПолейПотребитель = УправлениеКонтактнойИнформацией.ПреобразоватьСтрокуВСписокПолей(КИПотребителя);
		
		СтруктураАдресаЗдания = ПолучитьСтруктуруАдреса(СписокПолейЗдание);
		СтруктураАдресаОрганизации = ПолучитьСтруктуруАдреса(СписокПолейОрганизация);
		СтруктураАдресаПотребителя = ПолучитьСтруктуруАдреса(СписокПолейПотребитель);
		
		ОбластьШапкаДокумента = Макет.ПолучитьОбласть("ШапкаДокумента");
		ОбластьШапкаДокумента.Параметры.НомерДоговора = Нстр("ru = 'Договор № '; uk = 'Договір № '") + ВыборкаОсновная.НомерДокумента;
		
		Попытка
			ОбластьШапкаДокумента.Параметры.НасПункт = СтруктураАдресаЗдания.Город;
		Исключение 
			ОбластьШапкаДокумента.Параметры.НасПункт = "";
		КонецПопытки;
		
		ТабличныйДокумент.Вывести(ОбластьШапкаДокумента);
		
		ОбластьОсновныеПоложения = макет.ПолучитьОбласть("ОсновныеПоложения");
		
		ОбластьОсновныеПоложения.Параметры.ПолноеНаименованииеОрганизации = ВыборкаОсновная.ОрганизацияНаименованиеПолное;
		ОбластьОсновныеПоложения.Параметры.Директор = ВыборкаОсновная.ОрганизацияТекущийРуководитель;
		ОбластьОсновныеПоложения.Параметры.потребительУслуг = ВыборкаОсновная.ОтветственныйВладелец;
		Попытка
			ОбластьОсновныеПоложения.Параметры.НомерДома = СтруктураАдресаЗдания.Дом;
		Исключение
		КонецПопытки;
		
		ОбластьОсновныеПоложения.Параметры.НомерКвартиры = ВыборкаОсновная.НомерКвартиры;
		ОбластьОсновныеПоложения.Параметры.Адрес = ВыборкаОсновная.Здание;
		
		ТабличныйДокумент.Вывести(ОбластьОсновныеПоложения);
		
		ОбластьПредТабличнаяНадпись = Макет.ПолучитьОбласть("ПредТабличнаяНадпись");
		ОбластьПредТабличнаяНадпись.Параметры.ДатаЗадолженности = Формат(ТекущийДокумент.Дата,"ДФ=dd.MM.yyyy");;
		ОбластьПредТабличнаяНадпись.Параметры.СуммаЗадолженности = ВыборкаОсновная.СуммаДолга;
		ОбластьПредТабличнаяНадпись.Параметры.КолВоМесяцев = КоличествоСтрокРеструктуризации;
		ОбластьПредТабличнаяНадпись.Параметры.ДатаНачала =   Формат(ВыборкаОсновная.ДатаНачалаРассрочки,"ДФ=dd.MM.yyyy");
		ОбластьПредТабличнаяНадпись.Параметры.ДатаОкончания = Формат(ВыборкаОсновная.ДатаЗавершенияРассрочки,"ДФ=dd.MM.yyyy");
		
		ТабличныйДокумент.Вывести(ОбластьПредТабличнаяНадпись);
		
		ПоловинаОтДеления  =	КоличествоСтрокРеструктуризации/2; 
		ОстатокОтДеления = ПоловинаОтДеления - Цел(ПоловинаОтДеления);
		
		Если ОстатокОтДеления <> 0 тогда
			КоличествоСтрок = ЦЕЛ(ПоловинаОтДеления)+1;
		Иначе
			КоличествоСтрок = ПоловинаОтДеления;
		КонецЕсли;
		
		ТаблицаПлатежей =  Результат[1].Выгрузить();
		
		СчКолонкиДва = КоличествоСтрок+1;
		Сч = 1;
		Пока Сч <= КоличествоСтрок Цикл
			СтрокаДляКолонки1 = ТаблицаПлатежей.найти(Сч,"НомерСтроки");
			СтрокаДляКолонки2 = ТаблицаПлатежей.найти(СчКолонкиДва,"НомерСтроки");
			
			Если СтрокаДляКолонки1 <> Неопределено Тогда
				
				ОбластьСтроки = Макет.ПолучитьОбласть("СтрокаТаблицыМесяцев");
				
				ОбластьСтроки.Параметры.Месяц1 =  Формат(СтрокаДляКолонки1.МесяцНачисления,НСТР("ru = 'Л=ru_RU; ДФ=''MMMM yyyy'''; uk = 'Л=uk_UA; ДФ=''MMMM yyyy'''"));
				ОбластьСтроки.Параметры.Сумма1 = СтрокаДляКолонки1.СуммаПлатежа;
				
				Если СтрокаДляКолонки2 <> Неопределено Тогда
					ОбластьСтроки.Параметры.Месяц2 = Формат(СтрокаДляКолонки2.МесяцНачисления,НСТР("ru = 'Л=ru_RU; ДФ=''MMMM yyyy'''; uk = 'Л=uk_UA; ДФ=''MMMM yyyy'''"));
					ОбластьСтроки.Параметры.Сумма2 = СтрокаДляКолонки2.СуммаПлатежа;
				КонецЕсли;
				
				ТабличныйДокумент.Вывести(ОбластьСтроки);                                      
				СчКолонкиДва = СчКолонкиДва+1;
				Сч = Сч+1;
			КонецЕсли;
		КонецЦикла;

		// Підсумковий рядок графіка («Разом до сплати»).
		СуммаИтогГрафика = ТаблицаПлатежей.Итог("СуммаПлатежа");
		НомерСтрокиИтог = ТабличныйДокумент.ВысотаТаблицы + 1;
		ОбластьИтог = ТабличныйДокумент.Область(НомерСтрокиИтог, 1, НомерСтрокиИтог, 4);
		ОбластьИтог.Объединить();
		ОбластьИтог.Текст = НСтр("uk = 'Разом до сплати: '; ru = 'Итого к оплате: '")
			+ Формат(СуммаИтогГрафика, "ЧДЦ=2") + " " + НСтр("uk = 'грн'; ru = 'грн'");
		ОбластьИтог.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
		ОбластьИтог.Шрифт = Новый Шрифт(, , , Истина);

		ОбластьОснованаяЧасть = Макет.ПолучитьОбласть("ОснованаяЧасть1");
		ТабличныйДокумент.Вывести(ОбластьОснованаяЧасть);
		
		ОбластьОснованаяЧасть = Макет.ПолучитьОбласть("ОснованаяЧасть2");
		ТабличныйДокумент.Вывести(ОбластьОснованаяЧасть);
		
		
		ОбластьОснованаяЧасть = Макет.ПолучитьОбласть("ОснованаяЧасть3");
		ОбластьОснованаяЧасть.Параметры.ДатаОкончания = Формат(ВыборкаОсновная.ДатаЗавершенияРассрочки,
		НСТР("ru = 'Л=ru_RU; ДФ=''MMMM yyyy'''; uk = 'Л=uk_UA; ДФ=''MMMM yyyy'''"));
		ТабличныйДокумент.Вывести(ОбластьОснованаяЧасть);
		
		ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
		Если ВыборкаОсновная.ОтветственныйВладелец.ФизЛицо <> Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
			ФизическоеЛицо = ВыборкаОсновная.ОтветственныйВладелец.ФизЛицо;
			ОбластьПодвал.Параметры.ИНН = ФизическоеЛицо.ИНН;
			ПаспортныеДанные = ПолучитьПаспортныеДанныеФизЛица(ФизическоеЛицо);
			
			//Заполняются паспортные данные физ.лица
			Если ПаспортныеДанные <> Неопределено Тогда
				ОбластьПодвал.Параметры.Серия = ПаспортныеДанные.Серия;
				ОбластьПодвал.Параметры.НомерПаспорта = ПаспортныеДанные.Номер;
				ОбластьПодвал.Параметры.ДатаВыдачиПаспорта = ПаспортныеДанные.ДатаВыдачи;
				МассивПаспортныхДанных = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ПаспортныеДанные.КемВыдано," ");
				Если МассивПаспортныхДанных.Количество() <> 0 Тогда
					Если МассивПаспортныхДанных.Количество() > 3 Тогда
						ОбластьПодвал.Параметры.КемЧасть1 = МассивПаспортныхДанных[0] +" "+ МассивПаспортныхДанных[1] +" "+ МассивПаспортныхДанных[2]+" ";
						СтрокаКемЧасть2 = "";
						Для Индекс = 3 по МассивПаспортныхДанных.ВГраница() Цикл
							
							СтрокаКемЧасть2 = СтрокаКемЧасть2+?(СтрокаКемЧасть2= "",""," ")+ МассивПаспортныхДанных[Индекс];
						КонецЦикла;
						ОбластьПодвал.Параметры.КемЧасть2 = СтрокаКемЧасть2;
					ИначеЕсли МассивПаспортныхДанных.Количество() <= 3 Тогда
						СтрокаКемЧасть1 = "";
						Для Индекс = 0 по МассивПаспортныхДанных.ВГраница() Цикл
							
							СтрокаКемЧасть1 = СтрокаКемЧасть1+ ?(СтрокаКемЧасть1= "",""," ")+МассивПаспортныхДанных[Индекс];
						КонецЦикла;
						ОбластьПодвал.Параметры.КемЧасть1 = СтрокаКемЧасть1;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		Иначе
			ЮридическоеЛицо =  ВыборкаОсновная.ОтветственныйВладелец.ЮрЛицо;
			ОбластьПодвал.Параметры.ИНН = ЮридическоеЛицо.ИНН;
		КонецЕсли;
		ОбластьПодвал.Параметры.Организация = ВыборкаОсновная.организация;
		
		Попытка
			ОбластьПодвал.Параметры.ИндексОРГ 	= СтруктураАдресаОрганизации.Индекс+ ",";
		Исключение
		КонецПопытки;
		Попытка
			ОбластьПодвал.Параметры.СтранаОРГ 	= СтруктураАдресаОрганизации.Страна+ ",";
		Исключение
		КонецПопытки;
		Попытка
			ОбластьПодвал.Параметры.ОбластьОРГ 	= СтруктураАдресаОрганизации.Регион+ ",";
		Исключение
		КонецПопытки;
		Попытка
			ОбластьПодвал.Параметры.РайонОРГ 	= СтруктураАдресаОрганизации.Район+ ",";
		Исключение
		КонецПопытки;
		Попытка
			ОбластьПодвал.Параметры.ГородОРГ 	= СтруктураАдресаОрганизации.Город+ ",";
		Исключение
		КонецПопытки;
		Попытка
			ОбластьПодвал.Параметры.Индекс  	= СтруктураАдресаЗдания.Индекс+ ",";
		Исключение
		КонецПопытки;
		Попытка
			ОбластьПодвал.Параметры.Страна		= СтруктураАдресаЗдания.Страна+ ",";
		Исключение
		КонецПопытки;
		Попытка
			ОбластьПодвал.Параметры.Область		= СтруктураАдресаЗдания.Регион+ ",";
		Исключение
		КонецПопытки;
		Попытка
			ОбластьПодвал.Параметры.Район		= СтруктураАдресаЗдания.Район+ ",";
		Исключение
		КонецПопытки;
		Попытка
			ОбластьПодвал.Параметры.Город       = СтруктураАдресаЗдания.Город+ ",";		
		Исключение
		КонецПопытки;
		
		Попытка
			ОбластьПодвал.Параметры.УлицаОрг = СтруктураАдресаОрганизации.Улица;
		Исключение
		КонецПопытки;
		Попытка
			ОбластьПодвал.Параметры.Улица =  СтруктураАдресаЗдания.Улица;
		Исключение
		КонецПопытки;
		
		Попытка
			ОбластьПодвал.Параметры.НомерДома = СтруктураАдресаЗдания.Дом;
		Исключение;	
		КонецПопытки;
		
		ОбластьПодвал.Параметры.НомерКвартиры = ВыборкаОсновная.НомерКвартиры;
		ОбластьПодвал.Параметры.НомерСчета = ВыборкаОсновная.НомерСчета;
		ОбластьПодвал.Параметры.МФО = ВыборкаОсновная.МФО;
		ОбластьПодвал.Параметры.Банк = ВыборкаОсновная.БАнк;
		
		СтруктураФИОПотребитель = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Строка(ВыборкаОсновная.ОтветственныйВладелец)," ");
		СтруктураФИОДиректор = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Строка(ВыборкаОсновная.ОрганизацияТекущийРуководитель)," ");
		
		ИмяОтчество = "";
		Если СтруктураФИОПотребитель.Количество() > 0 Тогда
			Сч = 0;
			ОбластьПодвал.Параметры.Фамилия = СтруктураФИОПотребитель[Сч];
			
			Попытка
				
				ИмяОтчество = ИмяОтчество + СтруктураФИОПотребитель[1]+" ";
				ИмяОтчество = ИмяОтчество + " " + СтруктураФИОПотребитель[2];
				
			Исключение
				
			КонецПопытки;
			
		КонецЕсли;
		
		ОбластьПодвал.Параметры.ИмяОтчество = ИмяОтчество;
		
		Если СтруктураФИОДиректор.Количество() > 0 Тогда
			
			ДиректорПодпись = "";
			
			ДиректорПодпись = ДиректорПодпись+ СтруктураФИОДиректор[0];
			Попытка
				
				ДиректорПодпись = ДиректорПодпись+" "+Лев(СтруктураФИОДиректор[1],1)+".";
				ДиректорПодпись = ДиректорПодпись+" "+Лев(СтруктураФИОДиректор[2],1)+".";
			Исключение
				
			КонецПопытки;
			
		КонецЕсли;
		
		Если СтруктураФИОПотребитель.Количество() > 0 Тогда
			
			ПотребительПодпись = "";
			
			ПотребительПодпись = ПотребительПодпись+ СтруктураФИОПотребитель[0];
			Попытка
				
				ПотребительПодпись = ПотребительПодпись+" " +Лев(СтруктураФИОПотребитель[1],1)+".";
				ПотребительПодпись = ПотребительПодпись+" " +Лев(СтруктураФИОПотребитель[2],1)+".";
			Исключение
				
			КонецПопытки;
			
		КонецЕсли;
		ОбластьПодвал.Параметры.КодЕДРПОУ = ВыборкаОсновная.ЕДРПОУ;
		ОбластьПодвал.Параметры.ИНН = ВыборкаОсновная.ИНН;
		
		ОбластьПодвал.Параметры.ДиректорИО =  ДиректорПодпись;
		ОбластьПодвал.Параметры.ПотребительИО =  ПотребительПодпись;
		ТабличныйДокумент.Вывести(ОбластьПодвал);	
		
		//Обработчик
		
	КонецЕсли;	
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабличныйДокумент;

КонецФункции

// <Описание функции>
//
// Параметры
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
&НаСервере
Функция ПолучитьПаспортныеДанныеФизЛица(ФизЛцо)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Физлицо", ФизЛцо);
	Запрос.УстановитьПараметр("ВидДокумента", Справочники.ВидыДокументовФизическихЛиц.Паспорт);
	Запрос.Текст  = "ВЫБРАТЬ ПЕРВЫЕ 1
	                |	ДокументыФизическихЛицСрезПоследних.Серия,
	                |	ДокументыФизическихЛицСрезПоследних.Номер,
	                |	ДокументыФизическихЛицСрезПоследних.ДатаВыдачи,
	                |	ДокументыФизическихЛицСрезПоследних.КемВыдан
	                |ИЗ
	                |	РегистрСведений.ДокументыФизическихЛиц.СрезПоследних КАК ДокументыФизическихЛицСрезПоследних
	                |ГДЕ
	                |	ДокументыФизическихЛицСрезПоследних.Физлицо = &Физлицо
	                |	И ДокументыФизическихЛицСрезПоследних.ВидДокумента = &ВидДокумента";
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		СтруктураВозврата = Новый Структура(); 
		СтруктураВозврата.Вставить("Серия",Выборка.Серия);
		СтруктураВозврата.Вставить("Номер",Выборка.Номер);
		СтруктураВозврата.Вставить("ДатаВыдачи",Выборка.ДатаВыдачи);
		СтруктураВозврата.Вставить("КемВыдано",Выборка.КемВыдан);
		Возврат СтруктураВозврата;
	Иначе
		Возврат Неопределено;
	КонецЕсли;	
	

КонецФункции // ПолучитьПаспортныеДанныеФизЛица()


Функция ПолучитьСтруктуруАдреса(СписокПолей,Организация = Неопределено)
	
	СтруктураАдреса = Новый Структура();
	
	Если СписокПолей.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Для каждого Строка Из СписокПолей Цикл
			
		СтруктураАдреса.Вставить(Строка.Представление,Строка.Значение);
					
			
	КонецЦикла;
	
	Возврат СтруктураАдреса;
	
КонецФункции
